{
    "meta": {
        "title": "MOTHERSHIP OS",
        "subtitle": "Sistem Tadbir Urus Berdaulat Korporat dan Akauntabiliti Relasional",
        "version": "v1.1.3-LATCHED",
        "status": "AUTHORITATIVE // NARRATIVE MOAT",
        "classification": "TS-3 (Perancangan Strategik)",
        "authority": "THE OVERWATCH // SG-CANONICAL-2026",
        "timestamp": "2026-02-16T12:00:00Z",
        "audit_marker": "WHITEPAPER-v1.1.3-LATCHED",
        "marker_note": "[2026-02-15 13:25] // ENGINEER ELDER // SUBSTRAT NARATIF PENUH TELAH DILATCH.",
        "internal_ip_note": "Garis dasar harta intelek dalaman dan lejar artifak diselenggara sebagai dokumen TS-3 / TS-Λ3; dikecualikan daripada whitepaper awam dan disimpan dalam substrat forensik bagi tujuan perlindungan IP."
    },
    "abstract": {
        "summary": "Mothership OS ialah sistem operasi perniagaan yang direka untuk menyegerakkan entiti perundangan dengan keadaan digitalnya (Living Digital Twin). Sistem ini menggunakan Relational Accountability Model (RAM) untuk mentadbir interaksi Manusia–AI melalui hierarki deterministik lima lapis (L0–L4). Tidak seperti strategi penjajaran model dalaman (Constitutional AI), Mothership OS menguatkuasakan tadbir urus melalui ConstraintSet dan AgentContract luaran yang dikira pada masa larian.",
        "core_claims": [
            {
                "id": "relational_vs_constitutional",
                "title": "Relasional vs. Konstitusional",
                "description": "Tadbir urus ditakrifkan oleh ikatan relasi dan obligasi bersama, bukan oleh moraliti model yang abstrak."
            },
            {
                "id": "clinical_sovereignty",
                "title": "Kedaulatan Klinikal (Clinical Sovereignty)",
                "description": "Penguatkuasaan teknikal melalui Sentinel Protocol memastikan setiap tindakan agen dilatch kepada masa dan lokasi."
            },
            {
                "id": "forensic_learning",
                "title": "Pembelajaran Forensik (Forensic Learning)",
                "description": "Sistem RLHF gelung tertutup (Daedalus) menukar keputusan manusia kepada corak operasi."
            }
        ]
    },
    "sovereign_bond_stack": {
        "description": "Sovereign Bond Stack ialah pelaksanaan mekanikal RAM yang mentakrif aliran autoriti, obligasi dan liabiliti antara nod.",
        "foundational_bonds": [
            {
                "id": "founder_organization",
                "name": "Pengasas ↔ Organisasi",
                "label": "Kunci Autoriti Utama (Primary Authority Latch)",
                "description": "Pengasas memegang Burden of Intent; Organisasi memegang Burden of Context."
            },
            {
                "id": "founder_elders",
                "name": "Pengasas ↔ Steward (Elders)",
                "label": "Autoriti Taktikal Diwakilkan",
                "description": "Elders mentafsir garis misi dalam domain khusus dengan mandat teknikal untuk eskalasi risiko."
            },
            {
                "id": "senior_junior",
                "name": "Senior ↔ Junior",
                "label": "Liabiliti Penyeliaan (Supervisory Liability)",
                "description": "Nod peringkat lebih tinggi bertanggungjawab atas keluaran peringkat lebih rendah melalui gelung validasi PROCEED/VETO."
            },
            {
                "id": "peer_peer",
                "name": "Rakan Setara ↔ Rakan Setara",
                "label": "Penyegerakan Mendatar (Horizontal Synchronization)",
                "description": "Agen dalam lapisan yang sama berkoordinasi melalui ConstraintSet yang serasi untuk mencegah pertembungan domain."
            },
            {
                "id": "all_source_of_truth",
                "name": "Semua Nod ↔ Sumber Kebenaran (Source of Truth)",
                "label": "Sauh Forensik (Forensic Anchor)",
                "description": "Semua keadaan sistem mesti sejajar dengan data luaran yang diaudit (Lejar, Undang-undang, Bukti Forensik)."
            }
        ],
        "rbaa": {
            "name": "Autoriti Agen Berasaskan Peranan (Role-Based Agent Authority, RBAA)",
            "description": "RBAA ialah substrat kebenaran akses yang menterjemah ikatan RAM kepada skop data dan tindakan yang konkrit.",
            "properties": [
                {
                    "id": "spatial_latched",
                    "name": "Terkunci Ruang (Spatial-Latched)",
                    "description": "Setiap keputusan disahkan terhadap Harbor, Tenant dan Bidang Kuasa."
                },
                {
                    "id": "temporal_latched",
                    "name": "Terkunci Masa (Temporal-Latched)",
                    "description": "Keputusan diikat kepada jujukan misi dan cap masa, mengelakkan hanyutan tanpa konteks."
                }
            ]
        }
    },
    "sentinel_protocol": {
        "description": "Sentinel Protocol ialah enjin undang-undang teknikal bagi Mothership OS. Ia mentadbir bagaimana kerja diberi kuasa dan dirutekan dalam kerangka kedaulatan korporat.",
        "jurisdiction_and_logic": {
            "context_input": {
                "name": "SentinelContextInput",
                "fields": [
                    "tenantId",
                    "productMode",
                    "moduleSet",
                    "industryProfile",
                    "geoProfile",
                    "tsClass"
                ]
            },
            "constraint_sets": {
                "name": "ConstraintSets",
                "description": "Set kekangan yang dikira pada masa larian untuk mentakrif tingkah laku dan skop yang dibenarkan bagi agen."
            },
            "agent_contracts": {
                "name": "AgentContracts",
                "description": "Kontrak yang mengikat peranan tertentu kepada skop terhad seperti koleksi, API dan allowedActions."
            },
            "governance_sessions": {
                "name": "GovernanceSessions",
                "description": "Log berstruktur di mana setiap tindakan signifikan direkodkan bagi tujuan tadbir urus dan audit."
            }
        },
        "external_constraint_enforcement": {
            "description": "Dengan mengekalkan kekangan di luar weight model, Sentinel menghapuskan unsur ketidak telusan akibat unilateralism pembekal.",
            "principles": [
                "Struktur tadbir urus wujud di luar mana-mana model tunggal.",
                "Kekangan hanya boleh diubah melalui perubahan KONTROL formal yang diluluskan oleh Overwatch."
            ]
        }
    },
    "intelligence_substrate": {
        "description": "Komponen substrat kecerdasan yang menyokong tadbir urus, pembelajaran dan tingkah laku penasihat.",
        "library": {
            "id": "library",
            "name": "The Library",
            "description": "Substrat pangkalan ilmu berautoriti untuk corak yang telah terbukti. Ia tidak mengira kekangan, tetapi menyediakan memori bersama untuk agen L3/L4."
        },
        "daedalus": {
            "id": "daedalus_rlhf",
            "name": "Daedalus RLHF",
            "description": "Memantau GovernanceSessions untuk isyarat PROCEED/VETO manusia dan menukar pasangan interaksi kepada data latihan terpilih bagi penalaan model dan kurasi corak."
        },
        "icarus": {
            "id": "icarus_advisory",
            "name": "ICARUS Advisory",
            "description": "Copilot berskala tenant dengan akses tadbir urus baca-sahaja. Menerangkan kekangan kepada pemilik manusia dan membentuk ringkasan misi untuk saluran binaan."
        },
        "qfd_modules": {
            "id": "qfd_strategic_modules",
            "name": "Modul Strategik QFD",
            "description": "Menggunakan Quality Function Deployment untuk memetakan “Suara Manusia” (Voice of the Human) kepada tingkah laku teknikal, memastikan keupayaan dibina daripada keperluan sebenar pakar subjek (SME)."
        }
    },
    "architecture": {
        "description": "Struktur operasi Mothership OS merentasi timbunan hierarki lima lapis.",
        "layers": [
            {
                "id": "L0",
                "name": "THE FIRM",
                "role": "Akar organisasi yang memetakan peranan perundangan teras dan akar kedaulatan."
            },
            {
                "id": "L1",
                "name": "COMMAND PLANE",
                "role": "Lapisan niat manusia di mana THE OVERWATCH menetapkan garis strategik."
            },
            {
                "id": "L2",
                "name": "THE ELDERS",
                "role": "Kecerdasan strategik dan reka bentuk tadbir urus (Sentinel, Architect, Engineer)."
            },
            {
                "id": "L3",
                "name": "THE WORKSHOP",
                "role": "Substrat operasi untuk pelaksanaan dan pembelajaran (Labs, Forge, Daedalus)."
            },
            {
                "id": "L4",
                "name": "SPECIALIST INSTANCES",
                "role": "Permukaan berhadapan tenant dan agen khusus industri (MYAUDIT, VERIFY)."
            }
        ]
    },
    "sovereign_deployment_and_ip": {
        "infrastructure_posture": {
            "description": "Pendekatan pelaksanaan dan infrastruktur untuk Mothership OS.",
            "region": "asia-southeast1",
            "characteristics": [
                "Terkunci kepada rantau asia-southeast1.",
                "Akses ditadbir melalui Workload Identity Federation (WIF v2).",
                "Pendekatan zero-trust dikuatkuasakan."
            ]
        },
        "forensic_provenance": {
            "description": "Mekanisme untuk membuktikan asal-usul dan integriti IP.",
            "hash_algorithm": "SHA-256",
            "ledger": "Lejar Firestore jenis WORM",
            "guarantees": [
                "Bukti Point of Origin (POO) untuk artifak yang signifikan kepada IP.",
                "Integriti versi merentas dokumen strategik dan artifak."
            ]
        }
    },
    "ram_vs_constitutional_ai": {
        "description": "Pandangan perbandingan antara Constitutional AI dan Relational Accountability Model (RAM).",
        "metrics": [
            {
                "metric": "Penguatkuasaan (Enforcement)",
                "constitutional_ai": "Pemakluman dalaman model (internal model prompting)",
                "ram": "ConstraintSet luaran + AgentContract"
            },
            {
                "metric": "Logik Kekangan (Constraint Logic)",
                "constitutional_ai": "Prinsip moral abstrak",
                "ram": "Tanggungjawab relasional (RAM dan Bond Stack)"
            },
            {
                "metric": "Liabiliti (Liability)",
                "constitutional_ai": "Tidak telus di peringkat vendor (vendor-opaque)",
                "ram": "Kedaulatan manusia (Overwatch)"
            }
        ]
    }
}